## Staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                       |
|--------|-------------------------------------------------|
| add    | `aws_secretsmanager_secret.app_db_user`         |
|        | `aws_secretsmanager_secret_version.app_db_user` |
| update | `module.rds_proxy.aws_db_proxy.this[0]`         |
|        | `module.rds_proxy.aws_iam_role_policy.this[0]`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_secretsmanager_secret.app_db_user will be created
  + resource "aws_secretsmanager_secret" "app_db_user" {
      + arn                            = (known after apply)
      + description                    = "Database superuser app_db_user, database connection values"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "app_db_user"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags                           = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all                       = {
          + "CostCenter" = "notification-canada-ca-staging"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.app_db_user will be created
  + resource "aws_secretsmanager_secret_version" "app_db_user" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.rds_proxy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this"  {
      ~ id      = "2963539251" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:Decrypt"
                      - Condition = {
                          - StringEquals = {
                              - kms:ViaService = "secretsmanager.ca-central-1.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:kms:ca-central-1:239043911459:key/a92df413-fc30-4f3e-8047-7433e1a8ad02"
                      - Sid       = "DecryptSecrets"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:ListSecrets",
                          - "secretsmanager:GetRandomPassword",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ListSecrets"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:ListSecretVersionIds",
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:postgres-eDOk4f"
                      - Sid      = "GetSecrets"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (4 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:secretsmanager:ca-central-1:239043911459:secret:postgres-eDOk4f",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.rds_proxy.aws_db_proxy.this[0] will be updated in-place
  ~ resource "aws_db_proxy" "this" {
        id                     = "rds-proxy"
        name                   = "rds-proxy"
        tags                   = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (10 unchanged attributes hidden)

      + auth {
          + auth_scheme = "SECRETS"
          + description = "Database superuser app_db_user, database connection values"
          + iam_auth    = "DISABLED"
          + secret_arn  = (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # module.rds_proxy.aws_iam_role_policy.this[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "this" {
        id     = "rds-proxy-to-secrets-role:rds-proxy-to-secrets-policy"
        name   = "rds-proxy-to-secrets-policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:Decrypt"
                      - Condition = {
                          - StringEquals = {
                              - kms:ViaService = [
                                  - "secretsmanager.ca-central-1.amazonaws.com",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:kms:ca-central-1:239043911459:key/a92df413-fc30-4f3e-8047-7433e1a8ad02"
                      - Sid       = "DecryptSecrets"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:ListSecrets",
                          - "secretsmanager:GetRandomPassword",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "ListSecrets"
                    },
                  - {
                      - Action   = [
                          - "secretsmanager:ListSecretVersionIds",
                          - "secretsmanager:GetSecretValue",
                          - "secretsmanager:GetResourcePolicy",
                          - "secretsmanager:DescribeSecret",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:postgres-eDOk4f"
                      - Sid      = "GetSecrets"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_db_user"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_user"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_cloudwatch_log_group.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_only\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_write\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_iam_role.this[0]"]

32 tests, 17 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
